print("******************复杂数据类型 table***************************")
-- 所有的复杂数据类型都是table
print("******************数组***************************")
a={1,2,3,nil,4,5,6,7,"1234"}
b={1,2,3,4,5,6,7,"1234"}
c={nil}
-- lua中索引从1开始
print(a[1])
-- #是通用的获取长度的关键字

print(#a)
print(#b)
print(#c)

print("******************数组的遍历***************************")
for i =1 ,#a do
	print(a[i])
end
print("******************二维数组***************************")
a={{1,2,3},{4,5,6}}
print("******************二维数组的遍历***************************")
for i = 1,#a do
	b=a[i]
	for j=1,#b do
		print(b[j])
	end
end
print("******************自定义索引***************************")
-- aa = {[0]=1,2,3,[-1]=4,5}
-- print(aa[0]) 1
-- print(aa[-1]) 4
-- print(aa[1]) 2
-- print(aa[2]) 3
-- print(aa[3]) 5
-- print(#aa)3

-- aa = {[1]=1,[2]=2,[4] = 4,[5]=5}
-- print(#aa)  5
aa = {[1]=1,[2]=2,[6] = 6,[5]=5}
print(#aa)  