print("******************运算符***************************")

print("******************算数运算符***************************")
-- + - * / %
-- 没有自增自减 没有复合运算
-- 字符串可以进行算术运算符操作 会自动转成number
print("12.5"+0.5)
print("12.5"-0.5)

print("******************条件运算符***************************")
 -- && || ! "短路"
 -- and or not
 print(true and false)
 print(true or false)
 print(not false)
 print(true and print("123"))
 print(false and print("456"))

print("******************逻辑运算符***************************")
-- 不支持位运算 需要我们自己实现
print("******************位运算符***************************")
-- 也不支持  